2_ISIMO'24/DamBreak4Phase_Paanduv_Panchayat/simulation_damBreak4phase/0/alpha.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2268
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    leftWall
    {
        type            alphaContactAngle;
        thetaProperties ( ( water air ) 90 0 0 0 ( oil air ) 90 0 0 0 ( galistan air ) 90 0 0 0 ( water oil ) 90 0 0 0 ( water galistan ) 90 0 0 0 ( oil galistan ) 90 0 0 0 );
        value           nonuniform List<scalar> 
50
(
0
0
0
0
0
0
0
0
...
)
;
    }
    rightWall
    {
        type            alphaContactAngle;
        thetaProperties ( ( water air ) 90 0 0 0 ( oil air ) 90 0 0 0 ( galistan air ) 90 0 0 0 ( water oil ) 90 0 0 0 ( water galistan ) 90 0 0 0 ( oil galistan ) 90 0 0 0 );
        value           uniform 1;
    }
    lowerWall
    {
        type            alphaContactAngle;
        thetaProperties ( ( water air ) 90 0 0 0 ( oil air ) 90 0 0 0 ( galistan air ) 90 0 0 0 ( water oil ) 90 0 0 0 ( water galistan ) 90 0 0 0 ( oil galistan ) 90 0 0 0 );
        value           nonuniform List<scalar> 
62
(
0
0
0
0
0
0
0
0
...
)
;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
