2_ISIMO'24/DamBreak4Phase_Paanduv_Panchayat/simulation_damBreak4phase/0/alphas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alphas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2268
(
2
2
2
2
2
2
2
2
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
2
2
2
2
2
2
2
2
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           uniform 3;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
62
(
2
2
2
2
2
2
2
2
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           uniform 3;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
